# Taps
tap 'homebrew/bundle'
tap 'jorgelbg/tap' # for pinentry-touchid
tap 'cantino/mcfly'
tap 'koekeishiya/formulae' # yabai
tap 'oven-sh/bun'

tap 'cloudfoundry/tap'
tap 'pivotal/tap'


brew 'asciinema'
brew 'asdf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bun'
brew 'chafa'
brew 'colima'
brew 'coreutils'
brew 'curl'
brew 'direnv'
brew 'docker'
brew 'docker-completion'
brew 'docker-ls'
brew 'eza'
brew 'fd'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'git-lfs'
brew 'gnu-sed'
brew 'gpg'
brew 'gpg-tui'
brew 'gpg2'
brew 'httpie'
brew 'imagemagick'
brew 'jq'
brew 'kejadlen/git-together/git-together'
brew 'kubectx'
brew 'lazydocker'
brew 'lazygit'
brew 'libyaml'
brew 'lua-language-server'
brew 'luarocks'
brew 'markdown-toc'
brew 'markdownlint-cli'
brew 'marksman'
brew 'mas'
brew 'mcfly'
brew 'neovim'
brew 'nvm'
brew 'oniguruma'
brew 'pinentry-touchid'
brew 'pkg-config'
brew 'pre-commit'
brew 'prettier'
brew 'readline'
brew 'ripgrep'
brew 'rustup-init'
brew 's3cmd'
brew 'skhd'
brew 'starship'
brew 'taplo'
brew 'terraform-ls'
brew 'tmux'
brew 'tmuxinator'
brew 'tree'
brew 'vault'
brew 'wget'
brew 'withgraphite/tap/graphite'
brew 'xplr'
brew 'xz'
brew 'yabai'
brew 'yaml-language-server'
brew 'yarn'
brew 'zlib'
brew 'zoxide'

cask '1password'
cask 'adguard'
cask 'capacities'
cask 'dash'
cask 'flameshot'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-source-code-pro-for-powerline'
cask 'font-symbols-only-nerd-font'
cask 'font-victor-mono-nerd-font'
cask 'gpg-suite-no-mail'
cask 'istat-menus'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keyboard-maestro'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'raycast'
cask 'slack'
cask 'wezterm'

# Mac App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
